2. rename the 'sex' column to gender.

3. Add a new column named 'active', and set all values to True.

4. print only the columns name and email.

5. Add 5 more purchases to every entry in the purchases column and print the dataframe.

6. print the filtered dataframe to include only rows where purchases are greater than 20.

7. Change all 'm' to 'male' and 'f' to 'female' in 'gender' column (changed in step 2) and print the dataframe.

In [75]:
import pandas as pd

df = pd.DataFrame(data = {'Name': ['Nate', 'John', 'Jane', 'Mandy'], 
                        'Age': ['39', '23', '31', '25'], 
                        'Sex': ['M', 'M', 'F', 'F'], 
                        'Email': ['nate@gmail.com', 'john@gmail.com', 'jane@gmail.com', 'mandy@gmail.com'], 
                        'Purchases': ['34','12', '42', '8']
                        })

print (df)

    Name Age Sex            Email Purchases
0   Nate  39   M   nate@gmail.com        34
1   John  23   M   john@gmail.com        12
2   Jane  31   F   jane@gmail.com        42
3  Mandy  25   F  mandy@gmail.com         8

In [76]:
df = df.rename(columns={'Sex' :'Gender'})

In [77]:
print(df)

    Name Age Gender            Email Purchases
0   Nate  39      M   nate@gmail.com        34
1   John  23      M   john@gmail.com        12
2   Jane  31      F   jane@gmail.com        42
3  Mandy  25      F  mandy@gmail.com         8

In [78]:
df['Active'] = True
df

    Name Age Gender            Email Purchases  Active
0   Nate  39      M   nate@gmail.com        34    True
1   John  23      M   john@gmail.com        12    True
2   Jane  31      F   jane@gmail.com        42    True
3  Mandy  25      F  mandy@gmail.com         8    True

In [79]:
df[['Name', 'Email']]

    Name            Email
0   Nate   nate@gmail.com
1   John   john@gmail.com
2   Jane   jane@gmail.com
3  Mandy  mandy@gmail.com

In [ ]:
df['Purchases'] = pd.to_numeric(df['Purchases'])

In [90]:
df['Purchases'] = df['Purchases'] + 5
df

    Name Age Gender            Email  Purchases  Active
0   Nate  39      M   nate@gmail.com         39    True
1   John  23      M   john@gmail.com         17    True
2   Jane  31      F   jane@gmail.com         47    True
3  Mandy  25      F  mandy@gmail.com         13    True

In [91]:
df.loc[df['Purchases'] > 20]

   Name Age Gender           Email  Purchases  Active
0  Nate  39      M  nate@gmail.com         39    True
2  Jane  31      F  jane@gmail.com         47    True

In [102]:
for item in df.index:
    if df.at[item, 'Gender'] == 'M': 
        df.at[item, 'Gender'] = 'Male'
    if df.at[item, 'Gender'] == 'F': 
        df.at[item, 'Gender'] = 'Female'
print(df)

    Name Age  Gender            Email  Purchases  Active
0   Nate  39    Male   nate@gmail.com         39    True
1   John  23    Male   john@gmail.com         17    True
2   Jane  31  Female   jane@gmail.com         47    True
3  Mandy  25  Female  mandy@gmail.com         13    True